using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.UI;
using System.Web.UI.WebControls;
using WebApplicationMining.Process;

namespace WebApplicationMining
{
    public partial class Result : System.Web.UI.Page
    {

        protected void Page_Load(object sender, EventArgs e)
        {
            Home prevPage = this.PreviousPage;
            if (prevPage != null && prevPage.IsCrossPagePostBack)
            {
                if (!IsPostBack)
                {
                    int result = 0;
                    MiningLocation getLocation = new MiningLocation();
                    var gender = prevPage.gender;
                    var disease = prevPage.disease;
                    var movementDisorders = prevPage.movement_disorders;
                    var career = prevPage.career;
                    var incomePerMonth = prevPage.income_per_month;
                    var activityLiking = prevPage.activity_liking;
                    var tourismFormats = prevPage.tourism_formats;
                    result = getLocation.SelectLocation(gender.ToString(), disease.ToString()
                        , movementDisorders.ToString(), career.ToString(), incomePerMonth.ToString(),
                        activityLiking.ToString(), tourismFormats.ToString());
                    SetContent(result);
                }
            }
            else
            {
                Response.Redirect("~/Home.aspx");
            }
        }

        private void SetContent(int result)
        {
            string path = "";
            string cardcolors = "";
            string h_name = "";
            string span_location = "";
            string span_navigation = "";
            string detail = "";
            if (result == 1)
            {
                path = "picture/location/location1.jpg";
                cardcolors = "card-content white-text teal darken-1";
                h_name = "อุทยานแห่งชาติสาละวิน";
                span_location = "สถานที่ตั้ง: อำเภอแม่สะเรียง จังหวัดแม่ฮ่องสอน";
                span_navigation = "การเดินทาง: รถยนต์ ";
                detail = @"รายละเอียด 
                            อุทยานแห่งชาติสาละวินเป็นอุทยานแห่งชาติมีสภาพป่าไม้สมบูรณ์ทิวทัศน์และลักษณะทางธรรมชาติที่สวยงามซึ่งแต่เดิมเป็นป่าสงวนแห่งชาติ 'ป่าสาละวิน' ตั้งอยู่ในจังหวัดแม่ฮ่องสอน ในเขตอำเภอสบเมย และ อำเภอแม่สะเรียง มีพื้นทีทั้งหมด 450,950 ไร่ (721.25 ตารางกิโลเมตร) มีพื้นที่ติดชายแดนระหว่างประเทศไทย และ ประเทศพม่า อุทยานแห่งชาติสาละวิน มีภูมิประเทศเป็นเทือกเขาสลับซับซ้อน ซึ่งเป็นส่วนหนึ่งของเทือกเขาถนนธงชัย กับที่ราบริมฝั่งน้ำ มีความสูงจากระดับน้ำทะเล สูงสุด 1,027 เมตร ต่ำสุด 200 เมตร ยอดเขาที่สูงที่สุด อยู่ทางทิศเหนือ บริเวณอุทยาน ปกคลุมไปด้วยสภาพป่าที่อุดมของป่าเบญจพรรณ ป่าเต็งรัง ป่าดิบแล้ง และยังเป็นแหล่งต้นน้ำลำธารของแม่น้ำยวม แม่น้ำสาละวิน แม่น้ำกองคา แม่น้ำแม่แงะ และแม่น้ำหาร มีแหล่งน้ำอุปโภคบริโภคตามธรรมชาติ ได้แก่ แม่น้ำสาละวิน น้ำแม่ก๋อน น้ำแม่กองคา น้ำแม่แง น้ำแม่ปอ น้ำแม่เวน น้ำแม่สามแลบ แม่น้ำยวม ห้วยกองก๊าด ห้วยแม่สะเกิบ ห้วยแม่ละมอง ห้วยแม่สะลาบ ห้วยวอก ห้วยบง ห้วยอีนวล ห้วยโผ ห้วยแม่แต๊ะ ห้วยแม่อมลอง และ ห้วยแม่สามบาก";
            }
            else if (result == 2)
            {
                path = "picture/location/location2.jpg";
                cardcolors = "card-content white-text teal darken-1";
                h_name = "สวนสัตว์เชียงใหม่";
                span_location = "สถานที่ตั้ง: 100 ถนนหัวแก้ว, อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50200";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ เครื่องบิน ";
                detail = @"รายละเอียด 
                        สวนสัตว์เชียงใหม่ เป็นสวนสัตว์ในความดูแลขององค์การสวนสัตว์ ในพระบรมราชูปถัมภ์ ตั้งอยู่บริเวณทางขึ้นดอยสุเทพ บนถนนห้วยแก้ว ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ เปิดให้บริการทุกวัน ตั้งแต่ 8.00 น. - 17.00 น. มีสัตว์อยู่ในสวนสัตว์จำนวนมาก เช่น เม่น นกยูง เสือโคร่ง เสือขาว กวาง แรด ฮิปโปเตมัส ช้าง หมี อีเห็น และยังมีส่วนจัดแสดงหมีแพนด้า ช่วงช่วง และ หลินฮุ่ย จากประเทศจีน ภายในสวนสัตว์เชียงใหม่มีโบราณสถานที่ชื่อว่าวัดกู่ดินขาว ที่เป็นซึ่งตั้งอยู่ในบริเวณเวียงเจ็ดลิน และมีการแสดงความสามารถของสัตว์ เช่น นกมาคอว์ นาก นกกระทุง และมีส่วนจัดแสดงเพนกวินและแมวน้ำ";
            }
            else if (result == 3)
            {
                path = "picture/location/location3.jpg";
                cardcolors = "card-content white-text teal darken-1";
                h_name = "เชียงใหม่ไนท์ซาฟารี";
                span_location = "สถานที่ตั้ง: 33 หมู่ 12 ตำบลแม่เหียะ อำเภอเมืองเชียงใหม่ และ ตำบลหนองควาย อำเภอหางดง จังหวัดเชียงใหม่ 50230";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ เครื่องบิน";
                detail = @"รายละเอียด  เชียงใหม่ไนท์ซาฟารี (อังกฤษ: Chiang Mai Night Safari) เป็นสวนสัตว์เปิดที่ตั้งอยู่ในตำบลแม่เหียะ อำเภอเมืองเชียงใหม่ และ ตำบลหนองควาย อำเภอหางดง จังหวัดเชียงใหม่ บริเวณด้านหลังทางทิศตะวันตกของอุทยานหลวงราชพฤกษ์ เป็นสวนสัตว์ของรัฐบาล ภายใต้การกำกับดูแลของสำนักงานพัฒนาพิงคนคร (องค์การมหาชน) เปิดให้เข้าชมเป็นครั้งแรกเมื่อ 18 พฤศจิกายน พ.ศ. 2548 และเปิดบริการอย่างเป็นทางการเมื่อ วันที่ 6 กุมภาพันธ์ พ.ศ. 2549 ในระยะเริ่มแรกอยู่ในภายใต้การดูแลขององค์การบริหารการพัฒนาพื้นที่พิเศษเพื่อการท่องเที่ยวอย่างยั่งยืน ถือเป็นสวนสัตว์กลางคืนแห่งแรกในประเทศไทย และถือเป็นสวนสัตว์กลางคืนที่ใหญ่ที่สุดในโลก ด้วยขนาดพื้นที่ 819 ไร่ ในปัจจุบันเชียงใหม่ไนท์ซาฟารีได้ปรับเปลี่ยนรูปแบบการให้บริการที่สามารถท่องเที่ยวได้ตลอดทั้งวัน ทั้งในเวลากลางวัน และในเวลากลางคืน";
            }
            else if (result == 4)
            {
                path = "picture/location/location4.jpg";
                cardcolors = "card-content white-text teal darken-1";
                h_name = "กว๊านพะเยา";
                span_location = "สถานที่ตั้ง: ตำบลเวียง อำเภอเมือง จังหวัดพะเยา";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง เครื่องบิน ";
                detail = @"รายละเอียด 
                    กว๊านพะเยา อยู่ในอำเภอเมืองพะเยา จังหวัดพะเยา เป็นทะเลสาบน้ำจืดใหญ่เป็นอันดับ 1 ในภาคเหนือ และอันดับ 4 ในประเทศไทย  คำว่า “กว๊าน” ภาษาพื้นเมืองหมายถึง “บึง” กว๊านพะเยา จึงเป็นบึงน้ำอันกว้างใหญ่สุดสายตา โอบล้อมขุนเขาดอยแม่ใจ ที่ตั้งตระหง่านอยู่ด้านทิศตะวันตก ในยามเย็นและยามเช้าตรู่สีสันของท้องฟ้า และสายน้ำงดงามตรึงใจดังภาพเขียน เป็นภาพบรรยากาศอันแสนประทับใจที่ได้พบเห็นเมื่อมาเยือนเมืองพะเยาแห่งนี้";
            }
            else if (result == 5)
            {
                path = "picture/location/location5.jpg";
                cardcolors = "card-content white-text  red darken-1";
                h_name = "อนุสาวรีย์พ่อขุนเม็งรายมหาราช";
                span_location = "สถานที่ตั้ง: ถนนห้าแยกพ่อขุนเม็งราย ถนนเชียงราย-แม่จัน อำเภอเมือง จังหวัดเชียงราย";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง เครื่องบิน ";
                detail = @"รายละเอียด 
                            อุทยานแห่งชาติสาละวินเป็นอุทยานแห่งชาติมีสภาพป่าไม้สมบูรณ์ทิวทัศน์และลักษณะทางธรรมชาติที่สวยงามซึ่งแต่เดิมเป็นป่าสงวนแห่งชาติ ""ป่าสาละวิน"" ตั้งอยู่ในจังหวัดแม่ฮ่องสอน ในเขตอำเภอสบเมย และ อำเภอแม่สะเรียง มีพื้นทีทั้งหมด 450,950 ไร่ (721.25 ตารางกิโลเมตร) มีพื้นที่ติดชายแดนระหว่างประเทศไทย และ ประเทศพม่า อุทยานแห่งชาติสาละวิน มีภูมิประเทศเป็นเทือกเขาสลับซับซ้อน ซึ่งเป็นส่วนหนึ่งของเทือกเขาถนนธงชัย กับที่ราบริมฝั่งน้ำ มีความสูงจากระดับน้ำทะเล สูงสุด 1,027 เมตร ต่ำสุด 200 เมตร ยอดเขาที่สูงที่สุด อยู่ทางทิศเหนือ บริเวณอุทยาน ปกคลุมไปด้วยสภาพป่าที่อุดมของป่าเบญจพรรณ ป่าเต็งรัง ป่าดิบแล้ง และยังเป็นแหล่งต้นน้ำลำธารของแม่น้ำยวม แม่น้ำสาละวิน แม่น้ำกองคา แม่น้ำแม่แงะ และแม่น้ำหาร มีแหล่งน้ำอุปโภคบริโภคตามธรรมชาติ ได้แก่ แม่น้ำสาละวิน น้ำแม่ก๋อน น้ำแม่กองคา น้ำแม่แง น้ำแม่ปอ น้ำแม่เวน น้ำแม่สามแลบ แม่น้ำยวม ห้วยกองก๊าด ห้วยแม่สะเกิบ ห้วยแม่ละมอง ห้วยแม่สะลาบ ห้วยวอก ห้วยบง ห้วยอีนวล ห้วยโผ ห้วยแม่แต๊ะ ห้วยแม่อมลอง และ ห้วยแม่สามบาก";

            }
            else if (result == 6)
            {
                path = "picture/location/location6.jpg";
                cardcolors = "card-content white-text  red darken-1";
                h_name = "พระราชวังจันทร์";
                span_location = "สถานที่ตั้ง: ค่ายสมเด็จพระนเรศวรมหาราช กองทัพภาคที่ 3 ถนนวังจันทน์ ตำบลในเมือง อำเภอเมือง จังหวัดพิษณุโลก";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง ";
                detail = @"รายละเอียด  พระราชวังจันทน์ ตั้งอยู่ติดกับ ค่ายสมเด็จพระนเรศวรมหาราช กองทัพภาคที่ 3 ถนนวังจันทน์ ตำบลในเมือง อำเภอเมือง จังหวัดพิษณุโลก เป็นที่ตั้งศาลสมเด็จพระนเรศวรมหาราช ในอดีตยังเคยเป็นที่ตั้งของโรงเรียนพิษณุโลกพิทยาคม ปัจจุบัน กรมศิลปากร ได้เข้ามาทำการบูรณะค้นหาแนวเขตพระราชวังจันทน์ ระยะที่ 1 เสร็จสิ้นเป็นที่เรียบร้อยแล้ว";

            }
            else if (result == 7)
            {
                path = "picture/location/location7.jpg";
                cardcolors = "card-content white-text  red darken-1";
                h_name = "อนุสาวรีย์พระยาพิชัยดาบหัก";
                span_location = "สถานที่ตั้ง: ถนน ประชานิมิตร ตำบล ท่าอิฐ อำเภอเมืองอุตรดิตถ์ อุตรดิตถ์ 53000";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง ";
                detail = @"รายละเอียด  อนุสาวรีย์พระยาพิชัยดาบหัก ประดิษฐานอยู่หน้าศาลากลางจังหวัดอุตรดิตถ์ สร้างขึ้นเพื่อเป็นเกียรติประวัติในความกล้าหาญ รักชาติและเสียสละ เมื่อครั้งพระยาพิชัยครองเมืองพิชัยในสมัยธนบุรี ท่านได้สร้างเกียรติประวัติไว้โดยเฉพาะอย่างยิ่ง เมื่อปี พ.ศ. 2316 พม่ายกทัพมาตีเมืองพิชัย พระยาพิชัย ได้ยกทัพไปสกัดทัพพม่าจนแตกพ่ายกลับไป การรบในครั้งนั้นดาบคู่มือของพระยาพิชัยข้างขวาได้หักไปหนึ่งเล่ม แต่ก็ยังรบได้ชัยชนะต่อทัพพม่า ด้วยวีรกรรมดังกล่าว จึงได้สมญานามว่า พระยาพิชัยดาบหัก อนุสาวรีย์แห่งนี้ออกแบบและหล่อโดยกรมศิลปากร ทำพิธีเปิดเมื่อวันที่ 20 กุมภาพันธ์ พ.ศ. 2512";
            }
            else if (result == 8)
            {
                path = "picture/location/location8.jpg";
                cardcolors = "card-content white-text  red darken-1";
                h_name = "ศาลสมเด็จพระนเรศวร";
                span_location = "สถานที่ตั้ง: ถนนวังจันทน์ ตำบลในเมือง เมืองพิษณุโลก พิษณุโลก 65000";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง ";
                detail = @"รายละเอียด  ศาลสมเด็จพระนเรศวร สถานที่ยึดเหนี่ยวทางจิตใจของชาวพิษณุโลกเมืองสองแคว เป็นสิ่งศักดิ์สิทธิ์ที่เป็นที่เคารพคู่บ้านคู่เมืองของชาวพิษณุโลกตั้งแต่อดีตจนถึงปัจจุบัน";

            }
            else if (result == 9)
            {
                path = "picture/location/location9.jpg";
                cardcolors = "card-content white-text  blue darken-1";
                h_name = "ศาลสมเด็จพระนเรศวร";
                span_location = "สถานที่ตั้ง: ถนนวังจันทน์ ตำบลในเมือง เมืองพิษณุโลก พิษณุโลก 65000";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง";
                detail = @"รายละเอียด  ศาลสมเด็จพระนเรศวร สถานที่ยึดเหนี่ยวทางจิตใจของชาวพิษณุโลกเมืองสองแคว เป็นสิ่งศักดิ์สิทธิ์ที่เป็นที่เคารพคู่บ้านคู่เมืองของชาวพิษณุโลกตั้งแต่อดีตจนถึงปัจจุบัน";
            }
            else if (result == 10)
            {
                path = "picture/location/location10.jpg";
                cardcolors = "card-content white-text  blue darken-1";
                h_name = "วัดพระธาตุช่อแฮ";
                span_location = "สถานที่ตั้ง: เลขที่ 1 หมู่ที่ 11 ถนนช่อแฮ ตำบลช่อแฮ อำเภอเมืองแพร่ จังหวัดแพร่";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ ";
                detail = @"รายละเอียด วัดพระธาตุช่อแฮ พระอารามหลวง เป็นวัดศักดิ์สิทธิ์เก่าแก่คู่บ้านคู่เมืองจังหวัดแพร่ และเป็นวัดพระธาตุประจำปีเกิดของผู้ที่เกิดปีขาล ตั้งอยู่เลขที่ 1 หมู่ที่ 11 ถนนช่อแฮ ตำบลช่อแฮ อำเภอเมืองแพร่ จังหวัดแพร่ บนเนื้อที่ 175 ไร่ บุคคลใดที่มาเที่ยวจังหวัดแพร่แล้วจะต้องมานมัสการพระธาตุช่อแฮ เพื่อเป็นสิริมงคลกับตนเอง จนมีคำกล่าวว่า ถ้ามาเที่ยวจังหวัดแพร่ แต่ไม่ได้มานมัสการพระธาตุช่อแฮเหมือนไม่ได้มาจังหวัดแพร่";

            }
            else if (result == 11)
            {
                path = "picture/location/location11.jpg";
                cardcolors = "card-content white-text blue darken-1";
                h_name = "วัดพระธาตุลำปางหลวง";
                span_location = "สถานที่ตั้ง: ตำบลลำปางหลวง อำเภอเกาะคา จังหวัดลำปาง 52130";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ เครื่องบิน";
                detail = @"รายละเอียด วัดพระธาตุลำปางหลวง (คำเมือง: LN-Wat Phra That Lampang Luang.png) ตั้งอยู่ในเขตตำบลลำปางหลวง อำเภอเกาะคา จังหวัดลำปาง อยู่ห่างจากตัวเมืองลำปางไปทางทิศตะวันตกเฉียงใต้ประมาณ 18 กิโลเมตร วัดตั้งอยู่บนเนินสูง มีการจัดวางผังและส่วนประกอบของวัดสมบูรณ์แบบที่สุด มีสิ่งก่อสร้าง และสถาปัตยกรรมต่าง ๆ บริเวณพุทธาวาสประกอบด้วย องค์พระธาตุลำปางหลวง เป็นประธาน มีบันไดนาคนำขึ้นไปสู่ซุ้มประตูโขง ถัดซุ้มประตูโขงขึ้นไปเป็น วิหารหลวง บริเวณทิศเหนือขององค์พระธาตุมีวิหารบริวารตั้งอยู่คือ วิหารน้ำแต้ม และ วิหารต้นแก้ว ด้านตะวันตกขององค์พระธาตุประกอบด้วย วิหารละโว้ และ หอพระพุทธบาท ด้านใต้มี วิหารพระพุทธ และอุโบสถ ทั้งหมดนี้จะแวดล้อมด้วยแนวกำแพงแก้วทั้งสี่ด้าน นอกกำแพงแก้วด้านใต้มีประตูที่จะนำไปสู่เขตสังฆาวาส ซึ่งประกอบด้วยอาคาร หอพระไตรปิฎก กุฏิประดิษฐาน พระแก้วดอนเต้า อาคารพิพิธภัณฑ์และกุฏิสงฆ์";
            }
            else if (result == 12)
            {
                path = "picture/location/location12.jpg";
                cardcolors = "card-content white-text blue darken-1";
                h_name = "วัดจามเทวี";
                span_location = "สถานที่ตั้ง: ถนนจามเทวี หมู่ 5 ตำบลในเมือง อำเภอเมือง จังหวัดลำพูน";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ ";
                detail = @"รายละเอียด 
                          วัดจามเทวี ตั้งอยู่บนถนนจามเทวี ตำบลในเมือง อำเภอเมือง จังหวัดลำพูนหรือที่ วัดจามเทวีชาวบ้านเรียกกันว่า วัดกู่กุดเป็นวัดเก่าแก่ที่สำคัญมา ตั้งแต่สมัยล้านนาไทย ที่มีความสําคัญทั้งทางด้านประวัติศาสตร์ และโบราณคดี
ศิลปะหริภุญชัย บ้างก็สะกดว่า หริภุญไชย นั้นมีศูนย์กลางความเจริญอยู่ที่เมืองหริภุญชัย หรือจังหวัดลำพูนในปัจจุบัน งานช่างของเมืองนี้เกี่ยวข้องกับงานช่างที่มีความเจริญรุ่งเรืองอยู่ก่อนของราชธานีพุกาม ในประเทศพม่า
ตามหลักฐานที่ได้พบศิลาจารึกนั้นเชื่อว่า พระราชโอรส ของพระนางจามเทวีคือ พระเจดีย์มหันตยศ และพระเจ้าอนันตยศโปรดให้สร้างวัดนี้ขึ้นเพื่อถวายพระเพลิง แล้วโปรดให้สร้างเจดีย์เหลี่ยมมียอดหุ้มด้วยทองทองเรียกชื่อว่า สุวรรณจังโกฏิ พระเจดีย์สุวรรณจังโกฏิ หรือพระเจดีย์จามเทวี เป็นเจดีย์สี่เหลี่ยมแบบ พุทธคยาในประเทศอินเดีย แต่ละด้านจะมีพระพุทธรูปยืนปางประทานพรอยู่เป็นชั้นๆ
 ";
            }
            else if (result == 13)
            {
                path = "picture/location/location13.jpg";
                cardcolors = "card-content white-text cyan darken-1";
                h_name = "วันร่องขุ่น";
                span_location = "สถานที่ตั้ง: ตำบลป่าอ้อดอนชัย อำเภอเมืองเชียงราย จังหวัดเชียงราย 57000";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ เครื่องบิน ";
                detail = @"รายละเอียด 
                            วัดร่องขุ่น เริ่มก่อสร้างตั้งแต่ พ.ศ. 2540 โดยท่านอาจารย์เฉลิมชัย โฆษิตพิพัฒน์ จิตรกรชั้นแนวหน้าของไทย ";
            }
            else if (result == 14)
            {
                path = "picture/location/location14.jpg";
                cardcolors = "card-content white-text cyan darken-1";
                h_name = "วัดพระธาตุดอยสุเทพ ";
                span_location = "สถานที่ตั้ง: อำเภอแม่สะเรียง จังหวัดแม่ฮ่องสอน";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ เครื่องบิน ";
                detail = @"รายละเอียด 
                            วัดพระธาตุดอยสุเทพราชวรวิหาร (คำเมือง: LN-Wat Phra That Doi Suthep.png) พระอารามหลวง ชั้นโท ชนิดราชวรวิหาร ตั้งอยู่บนยอดดอยสุเทพ เป็นหนึ่งในวัดที่มีความสำคัญมากที่สุดของจังหวัดเชียงใหม่ ก่อสร้างตามแบบศิลปะล้านนา มีเจดีย์ทรงเชียงแสน ฐานสูงย่อมุมระฆังทรงแปดเหลี่ยมปิดด้วยทองจังโก 2 ชั้น ลานเจดีย์เป็นจุดชมทิวทัศน์เมืองเชียงใหม่ ทางขึ้นเป็นบันไดนาคเจ็ดเศียรก่อปูน เจ้าอาวาสรูปปัจจุบันคือพระธรรมเสนาบดี (ธงชัย สุวณฺณสิริ)";

            }
            else if (result == 15)
            {
                path = "picture/location/location15.jpg";
                cardcolors = "card-content white-text cyan darken-1";
                h_name = "เขื่อนสิริกิติ์";
                span_location = "สถานที่ตั้ง: 40 หมู่ 10 ตำบลผาเลือด อำเภอท่าปลา จังหวัดอุตรดิตถ์";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง";
                detail = @"รายละเอียด 
                           เขื่อนสิริกิติ์ หรือที่เรียกกันในชื่อท้องถิ่นว่า เขื่อนท่าปลา จัดเป็นเขื่อนดินที่มีขนาดใหญ่ที่สุดในประเทศไทย อยู่ในอำเภอท่าปลา จังหวัดอุตรดิตถ์ กั้นแม่น้ำน่าน ที่ไหลลงมาจากอำเภอนาหมื่น จังหวัดน่าน เดิมอยู่ในความดูแลของกรมชลประทาน กระทรวงเกษตรและสหกรณ์ ภายหลังได้ติดตั้งโรงไฟฟ้าพลังงาน และมอบให้การไฟฟ้าฝ่ายผลิตแห่งประเทศไทยเป็นผู้รับผิดชอบดูแลต่อไป ทั้งนี้พื้นที่เหนือเขื่อนเป็นแอ่งเก็บน้ำขนาดใหญ่ และเป็นสถานที่ท่องเที่ยวที่สำคัญของจังหวัดอุตรดิตถ์ด้วย";
            }
            else if (result == 16)
            {
                path = "picture/location/location16.jpg";
                cardcolors = "card-content white-text cyan darken-1";
                h_name = "สะพานรัษฎาภิเศก";
                span_location = "สถานที่ตั้ง: เขตตำบลหัวเวียง อำเภอเมืองลำปาง จังหวัดลำปาง ";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง รถไฟ ";
                detail = @"รายละเอียด 
                            สะพานรัษฎาภิเศก (คำเมือง: LN-Khua Ratsada.png) หรือ สะพานขาว ตั้งอยู่ที่ถนนรัษฎา เป็นสะพานข้ามแม่น้ำวัง ตั้งอยู่ในเขตตำบลหัวเวียง อำเภอเมืองลำปาง จังหวัดลำปาง เดิมเป็นสะพานโครงสร้างไม้ ที่ทางเจ้านรนันทไชยชวลิต เจ้าผู้ครองนครลำปาง และชาวจังหวัดลำปางได้จัดสร้างขึ้นเพื่อเฉลิมพระเกียรติในวาระที่พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวฯ รัชกาลที่ 5 ในโอกาสที่พระองค์ครองราชย์ครบ 25 ปี ในปี พ.ศ. 2437";
            }
            else if (result == 17)
            {
                path = "picture/location/location17.jpg";
                cardcolors = "card-content white-text orange darken-1";
                h_name = "ไร่ชาฉุยฟง";
                span_location = "สถานที่ตั้ง: 97 หมู่ 8 บ้านป่าซาง อำเภอแม่จัน จังหวัดเชียงราย 57110 ";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง เครื่องบิน ";
                detail = @"รายละเอียด 
                           ไร่ชาฉุยฟง เป็นของ บริษัท ฉุยฟงที จำกัด ซึ่งป็นผู้ผลิตใบชารายใหญ่ที่สุดใน จังหวัดเชียงราย โดยมีประสบการณ์ยาวนานในการเพาะปลูกชามานานกว่า 40 ปี โดยมีการพัฒนาให้เป็นแหล่งท่องเที่ยว จนกลายเป็นที่รู้จักกันอย่างแพร่หลาย ไร่ชามีอยู่ด้วยกัน 2 แห่ง คือ อำเภอแม่จัน เชียงราย และบ้านพญาไพร ตำบลเทอดไทย อำเภอแม่ฟ้าหลวง แต่ในที่นี้จะพูดถึง ไร่ชาฉุยฟงที่ อำเภอแม่จัน ไร่ชาตั้งอยู่บนเนื้อที่กว่า 1,000 ไร่ บรรยากาศโดยรอบสีเขียวชะอุ่ม ไร่ชาขนาดใหญ่ตั้งอยู่บนเนินเขาปลูกลดหลั่นกันเป็นขั้นบันได แล้วที่นี่ยังมีร้านอาหาร และเครื่องดื่ม เบเกอรี่ ไว้บริการ เมนูยอดนิยม เช่น สปาเก็ตตี้ยูนาน หมั่นโถวชาเขียว ชาเขียวเย็น เค้กชาเขียว เป็นต้น นอกจากนี้ที่ไร่ชาฉุยฟงยังสามารถชิมชาและเลือกซื้อชาคุณภาพดีหลากสายพันธุ์ เป็นของฝากได้";
            }
            else if (result == 18)
            {
                path = "picture/location/location18.jpg";
                cardcolors = "card-content white-text orange darken-1";
                h_name = "สวนชมน่านเฉลิมพระเกียรติ";
                span_location = "สถานที่ตั้ง: พิษณุโลก เทศบาลนครพิษณุโลก 65000";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง";
                detail = @"รายละเอียด 
                           สวนชมน่าน เป็นสวนสาธารณะริมแม่น้ำน่าน แหล่งพักผ่อนยามเย็นของชาวพิษณุโลก เป็นสถานที่พักผ่อนหย่อนกายเย็นๆ ในสวนมีทางเดินสามารถวิ่งออกกำลังกาย สนามเด็กเล่น และสนามกีฬาเล็กๆ เช่นสนามตระกร้อ นอกจากนี้ยังมีแอโรบิกให้เต้นเพื่อออกกำลังกายอีกด้วย ";
            }
            else if (result == 19)
            {
                path = "picture/location/location19.jpg";
                cardcolors = "card-content white-text orange darken-1";
                h_name = "เขาช้างล้วง";
                span_location = "สถานที่ตั้ง: พิษณุโลก";
                span_navigation = "การเดินทาง: รถยนต์ ";
                detail = @"รายละเอียด 
                           ...";
            }
            else if (result == 20)
            {
                path = "picture/location/location20.jpg";
                cardcolors = "card-content white-text orange darken-1";
                h_name = "เจดีย์วัดเกตุการาม";
                span_location = "สถานที่ตั้ง: ถนนเจริญราษฎร์ ตำบลวัดเกตุ อำเภอเมืองเชียงใหม่";
                span_navigation = "การเดินทาง: รถยนต์ รถประจำทาง";
                detail = @"รายละเอียด 
                          วัดเกตการามตั้งอยู่บนถนนเจริญราษฎร์ ตำบลวัดเกตุ อำเภอเมืองเชียงใหม่ เดิมชื่อว่า “วัดสระเกษ” สร้างขึ้นเมื่อปี พ.ศ. 1971 ในรัชสมัยพระเจ้าสามฝั่งแกน พระองค์ทรงโปรดให้พระยาเมือง พระยาคำ และพระยาลือ สร้างวัดแห่งนี้ขึ้น ชื่อ “วัดเกตการาม” มาจากคำว่า “เกศ” ซึ่งเป็นชื่อของพระธาตุเกศแก้วจุฬามณี บนสวรรค์ชั้นดาวดึงส์ ซึ่งเชื่อกันว่าเป็นที่ประดิษฐานพระเกศาธาตุของพระพุทธเจ้า ";
            }
            else
            {
                Response.Redirect("Home.aspx");
            }
            image_location.Src = path;
            div_card_color.Attributes["class"] = cardcolors;
            this.h_name.InnerText = h_name;
            this.span_location.InnerText = span_location;
            this.span_navigation.InnerText = span_navigation;
            this.detail.InnerText = detail;
        }
    }
}