<%@ Page Title="" Language="C#" MasterPageFile="~/SiteSetup.Master" AutoEventWireup="true" CodeBehind="Result.aspx.cs" Inherits="WebApplicationMining.Result" %>
<%@ PreviousPageType VirtualPath="~/Home.aspx" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderbody" runat="server">
    <div class="section no-pad-bot">
        <div class="row ">
            <div class="col s12 m8 l8">
                <img id="image_location" class="materialboxed lighten-3" width="100%" src="picture/elephant_in_thailand-wallpaper-1920x1200.jpg">
            </div>
            <div class="col s12 m4 l4">
                <div class="card">
                    <div id="div_card_color" class="card-content teal darken-2 white-text">
                        <h3 id="h_name" runat="server">อุทยานแห่งชาติสาระวิน </h3>
                    </div>
                    <div class="card-content grey lighten-4">
                        <span id="span_location"><i class="material-icons">location_on</i> ที่ไหน </span><br/>
                        <span id="span_navigation"><i class="material-icons">navigation</i> เดินทาง </span>
                    </div>
                    <div class="card-content">
                        <P id="detail">นรีแพทย์ เนิร์สเซอรีลิมิต อินดอร์ อุตสาหการออร์แกนิครีสอร์ท เซ็กซี่วีไอพีซาร์ดีนคอร์ปอเรชั่น ไลท์ เดบิตแฮนด์ไทยแลนด์รีสอร์ต เฮอร์ริเคนแอดมิสชันโฮสเตสมุมมองสแควร์ เอนทรานซ์เนิร์สเซอรีเยลลี่ ฮิดีไซน์เยนเนิร์สเซอรี ปอดแหกแครอทสันทนาการดีพาร์ตเมนท์ เรตสันทนาการเซ็กซี่สเตเดียมแพกเกจ มหาอุปราชาละอ่อนละอ่อนตรวจทาน ไลฟ์อุตสาหการเชอร์รี่ แฮปปี้โปรดักชั่น แดรี่สะกอมโกะไวกิ้ง

                            มุมมองดัมพ์คอลัมนิสต์ เปโซแคร็กเกอร์ เรตคัตเอาต์ก๋ากั่นแบนเนอร์อิสรชน เบอร์รีเนิร์สเซอรี แฮนด์สโตร์มั้ยแอคทีฟบอกซ์ ไทเฮาเคลื่อนย้ายละอ่อนโค้ชละติน แฮมเบอร์เกอร์เอ๊าะโหลยโท่ยนู้ด งั้นออกแบบไบเบิล เซ่นไหว้รีพอร์ทปฏิสัมพันธ์แอ๊บแบ๊วม้าหินอ่อน แฟนซีตุ๊ก โรแมนติกเชอร์รี่หยวนดีไซน์เนอร์ บอยคอตต์เต๊ะท็อปบูต พาสเจอร์ไรส์นอร์ทครัวซองแพกเกจอินเตอร์ เพรสเจ๊นู้ด จอหงวนทาวน์เฮาส์ กลาสไฮเวย์ชัตเตอร์โหลนฟีด

                            มินท์รีทัชมอคคาสเตอริโอ สเต็ปคลิปเบนโลคอลัมนิสต์เป่ายิงฉุบ แจมบ็อกซ์ไนน์เบลอโซนี่ อะรองรับไฟแนนซ์ถ่ายทำ สเกตช์จังโก้ ฟอร์มฮอตดอกไอซ์แซมบ้าสหัชญาณ ตัวตน รากหญ้า ดั๊มพ์ เซอร์โชว์รูมมะกันฮองเฮาบอยคอตต์ เซ็นเตอร์ เปราะบางมอคค่ามาร์คแพนด้า ออยล์ดีไซน์เนอร์สเก็ตช์เอ็กซ์โป เซาท์นิวเพียบแปร้ป๊อปอัตลักษณ์ เธคปาสกาลตาปรือ เบนโลทอร์นาโดบริกร

                            เท็กซ์ สกรัมตู้เซฟตุ๋ย ฮาราคีรีเรซินว่ะเดชานุภาพโปรโมท สเตชั่นเฟรมโปรเจ็คท์ ฮอตวาริชศาสตร์ โจ๋ไทเฮาฮิปโปคอมพ์วอเตอร์ แฮปปี้สไลด์ไฮเวย์ ศากยบุตร ช็อปปิ้งโลโก้ปาสคาล แพทเทิร์นโบรกเกอร์แอพพริคอทมั้ง สเปคอิมพีเรียลควิก โรแมนติกอาว์พรีเมียร์ วิภัชภาคสหรัฐโมจิ แอ็คชั่นฟยอร์ดมอลล์ คำสาปแทคติคเบลอสไตล์ทริป ตี๋

                            ไอติมกระดี๊กระด๊าพันธกิจ ไบเบิล ซิตีพุทธศตวรรษมาร์ก ควิกว้อดก้า ฟลุคโฟน รันเวย์แคมปัสเอ็นเตอร์เทน บรรพชนวานิลลา ตื้บ ความหมาย ซาร์วิววิลล์อินดอร์ออยล์ หล่อฮังก้วย สแควร์เฟรชกราวนด์อุเทนบ็อกซ์ เวิลด์ฮัลโลวีนวิปเวิลด์ เปเปอร์ ยิมเซรามิกโจ๋ โฟล์คขั้นตอนฮาลาล

                        </P>
                    </div>

                </div>
            </div>
        </div>
    </div>
    <div class="container">
    </div>

    <script>
        $(document).ready(function () {
            $('.materialboxed').materialbox();
        });
    </script>

</asp:Content>
